tiborsimon/embedded-tdd-headers/pic/pic18/pic18lf65k80_tdd.h
#define LATG3                         4439
#define LG3                           4440
#define LATG4                         4441
#define LG4                           4442
#define SLRCON                        4443
#define SLRA                          4444
#define SLRB                          4445
#define SLRC                          4446
#define SLRD                          4447
#define SLRE                          4448
#define SLRF                          4449
#define SLRG                          4450
#define ODCON                         4451
#define U1OD                          4452
#define U2OD                          4453
#define CCP1OD                        4454
#define CCP2OD                        4455
#define CCP3OD                        4456
#define CCP4OD                        4457
#define CCP5OD                        4458
#define SSPOD                         4459
#define TRISA                         4460
#define TRISA0                        4461
#define TRISA1                        4462
#define TRISA2                        4463
#define TRISA3                        4464
#define TRISA5                        4465
#define TRISA6                        4466
#define TRISA7                        4467
#define TRISB                         4468
#define TRISB0                        4469
#define TRISB1                        4470
#define TRISB2                        4471
#define TRISB3                        4472
#define TRISB4                        4473
#define TRISB5                        4474
#define TRISB6                        4475
#define TRISB7                        4476
#define TRISC                         4477
#define TRISC0                        4478
#define TRISC1                        4479
#define TRISC2                        4480
#define TRISC3                        4481
#define TRISC4                        4482
#define TRISC5                        4483
#define TRISC6                        4484
#define TRISC7                        4485
#define TRISD                         4486
#define TRISD0                        4487
#define TRISD1                        4488
#define TRISD2                        4489
#define TRISD3                        4490
#define TRISD4                        4491
#define TRISD5                        4492
#define TRISD6                        4493
#define TRISD7                        4494
#define TRISE                         4495
#define TRISE0                        4496
#define TRISE1                        4497
#define TRISE2                        4498
#define TRISE4                        4499
#define TRISE5                        4500
#define TRISE6                        4501
#define TRISE7                        4502
#define TRISF                         4503
#define TRISF0                        4504
#define TRISF1                        4505
#define TRISF2                        4506
#define TRISF3                        4507
#define TRISF4                        4508
#define TRISF5                        4509
#define TRISF6                        4510
#define TRISF7                        4511
#define TRISG                         4512
#define TRISG0                        4513
#define TRISG1                        4514
#define TRISG2                        4515
#define TRISG3                        4516
#define TRISG4                        4517
#define CCPTMRS                       4518
#define C1TSEL                        4519
#define C2TSEL                        4520
#define C3TSEL                        4521
#define C4TSEL                        4522
#define C5TSEL                        4523
#define REFOCON                       4524
#define RODIV0                        4525
#define RODIV                         4526
#define RODIV1                        4527
#define RODIV2                        4528
#define RODIV3                        4529
#define ROSEL                         4530
#define ROSSLP                        4531
#define ROON                          4532
#define OSCTUNE                       4533
#define TUN0                          4534
#define TUN                           4535
#define TUN1                          4536
#define TUN2                          4537
#define TUN3                          4538
#define TUN4                          4539
#define TUN5                          4540
#define PLLEN                         4541
#define INTSRC                        4542
#define PSTR1CON                      4543
#define STRA                          4544
#define STRB                          4545
#define STRC                          4546
#define STRD                          4547
#define STRSYNC                       4548
#define CMPL                          4549
#define CMPL0                         4550
#define CMPL1                         4551
#define PIE1                          4552
#define TMR1IE                        4553
#define TMR2IE                        4554
#define TMR1GIE                       4555
#define SSPIE                         4556
#define PIE1_TX1IE                    4557
#define TXIE                          4558
#define RCIE                          4559
#define RC1IE                         4560
#define ADIE                          4561
#define PSPIE                         4562
#define PIR1                          4563
#define TMR1IF                        4564
#define TMR2IF                        4565
#define TMR1GIF                       4566
#define SSPIF                         4567
#define PIR1_TX1IF                    4568
#define TXIF                          4569
#define RCIF                          4570
#define RC1IF                         4571
#define ADIF                          4572
#define PSPIF                         4573
#define IPR1                          4574
#define TMR1IP                        4575
#define TMR2IP                        4576
#define TMR1GIP                       4577
#define SSPIP                         4578
#define TX1IP                         4579
#define TXIP                          4580
#define RCIP                          4581
#define RC1IP                         4582
#define ADIP                          4583
#define PSPIP                         4584
#define PIE2                          4585
#define TMR3GIE                       4586
#define TMR3IE                        4587
#define HLVDIE                        4588
#define LVDIE                         4589
#define BCLIE                         4590
#define OSCFIE                        4591
#define PIR2                          4592
#define TMR3GIF                       4593
#define TMR3IF                        4594
#define HLVDIF                        4595
#define LVDIF                         4596
#define BCLIF                         4597
#define OSCFIF                        4598
#define IPR2                          4599
#define TMR3GIP                       4600
#define TMR3IP                        4601
#define HLVDIP                        4602
#define LVDIP                         4603
#define BCLIP                         4604
#define OSCFIP                        4605
#define PIE3                          4606
#define RXBNIE                        4607
#define PIE3_RXB1IE                   4608
#define CCP1IE                        4609
#define CCP2IE                        4610
#define PIE3_TXB0IE                   4611
#define CTMUIE                        4612
#define PIE3_TXB1IE                   4613
#define TXBNIE                        4614
#define PIE3_TXB2IE                   4615
#define PIE3_TX2IE                    4616
#define RC2IE                         4617
#define PIR3                          4618
#define RXBNIF                        4619
#define CCP1IF                        4620
#define CCP2IF                        4621
#define CTMUIF                        4622
#define TXBNIF                        4623
#define PIR3_TX2IF                    4624
#define RC2IF                         4625
#define IPR3                          4626
#define CCP1IP                        4627
#define RXBNIP                        4628
#define CCP2IP                        4629
#define CTMUIP                        4630
#define TX2IP                         4631
#define TXBNIP                        4632
#define RC2IP                         4633
#define RCSTA2                        4634
#define RCD82                         4635
#define RX9D2                         4636
#define RCSTA2_RX9D                   4637
#define OERR2                         4638
#define RCSTA2_OERR                   4639
#define FERR2                         4640
#define RCSTA2_FERR                   4641
#define ADDEN2                        4642
#define RCSTA2_ADDEN                  4643
#define RCSTA2_CREN                   4644
#define CREN2                         4645
#define SREN2                         4646
#define RCSTA2_SREN                   4647
#define RC92                          4648
#define RC8_92                        4649
#define RCSTA2_RX9                    4650
#define RX92                          4651
#define RCSTA2_SPEN                   4652
#define SPEN2                         4653
#define BAUDCON1                      4654
#define BAUDCON1_ABDEN                4655
#define ABDEN1                        4656
#define BAUDCON1_WUE                  4657
#define WUE1                          4658
#define BRG161                        4659
#define BAUDCON1_BRG16                4660
#define CKTXP                         4661
#define BAUDCON1_TXCKP                4662
#define SCKP1                         4663
#define TXCKP1                        4664
#define SCKP                          4665
#define DTRXP1                        4666
#define RXDTP1                        4667
#define DTRXP                         4668
#define BAUDCON1_RXDTP                4669
#define BAUDCON1_RCMT                 4670
#define RCMT1                         4671
#define RCIDL1                        4672
#define BAUDCON1_RCIDL                4673
#define ABDOVF1                       4674
#define BAUDCON1_ABDOVF               4675
#define HLVDCON                       4676
#define HLVDL                         4677
#define HLVDL0                        4678
#define HLVDL1                        4679
#define HLVDL2                        4680
#define HLVDL3                        4681
#define HLVDEN                        4682
#define IRVST                         4683
#define BGVST                         4684
#define VDIRMAG                       4685
#define PR4                           4686
#define T1GCON                        4687
#define T1GSS0                        4688
#define T1GSS                         4689
#define T1GSS1                        4690
#define T1GVAL                        4691
#define T1GGO_nT1DONE                 4692
#define nT1DONE                       4693
#define T1GGO_NOT_T1DONE              4694
#define NOT_T1DONE                    4695
#define T1GGO                         4696
#define T1GSPM                        4697
#define T1GTM                         4698
#define T1GPOL                        4699
#define TMR1GE                        4700
#define RCSTA1                        4701
#define RCSTA1_RX9D                   4702
#define RX9D1                         4703
#define RCD8                          4704
#define RCSTA1_OERR                   4705
#define OERR1                         4706
#define RCSTA1_FERR                   4707
#define FERR1                         4708
#define RCSTA1_ADDEN                  4709
#define ADDEN1                        4710
#define ADEN                          4711
#define RCSTA1_CREN                   4712
#define CREN1                         4713
#define SRENA                         4714
#define SREN1                         4715
#define RCSTA1_SREN                   4716
#define RC8_9                         4717
#define RCSTA1_RX9                    4718
#define nRC8                          4719
#define NOT_RC8                       4720
#define RC9                           4721
#define RX91                          4722
#define RCSTA1_SPEN                   4723
#define SPEN1                         4724
#define TXSTA1                        4725
#define TX9D1                         4726
#define TXSTA1_TX9D                   4727
#define TXD8                          4728
#define TRMT1                         4729
#define TXSTA1_TRMT                   4730
#define BRGH1                         4731
#define TXSTA1_BRGH                   4732
#define TXSTA1_SENDB                  4733
#define SENDB1                        4734
#define TXSTA1_SYNC                   4735
#define SYNC1                         4736
#define TXEN1                         4737
#define TXSTA1_TXEN                   4738
#define TX91                          4739
#define TX8_9                         4740
#define NOT_TX8                       4741
#define nTX8                          4742
#define TXSTA1_TX9                    4743
#define TXSTA1_CSRC                   4744
#define CSRC1                         4745
#define TXREG1                        4746
#define RCREG1                        4747
#define SPBRG1                        4748
#define T3GCON                        4749
#define T3GSS0                        4750
#define T3GSS                         4751
#define T3GSS1                        4752
#define T3GVAL                        4753
#define T3GGO                         4754
#define NOT_T3DONE                    4755
#define nT3DONE                       4756
#define T3GGO_nT3DONE                 4757
#define T3GGO_NOT_T3DONE              4758
#define T3GSPM                        4759
#define T3GTM                         4760
#define T3GPOL                        4761
#define TMR3GE                        4762
#define T3CON                         4763
#define TMR3ON                        4764
#define T3CON_RD16                    4765
#define nT3SYNC                       4766
#define NOT_T3SYNC                    4767
#define SOSCEN3                       4768
#define T3CON_SOSCEN                  4769
#define T3CKPS0                       4770
#define T3CKPS                        4771
#define T3CKPS1                       4772
#define TMR3CS0                       4773
#define TMR3CS                        4774
#define TMR3CS1                       4775
#define T3RD16                        4776
#define RD163                         4777
#define TMR3L                         4778
#define TMR3H                         4779
#define CMSTAT                        4780
#define C2OUT                         4781
#define CMP1OUT                       4782
#define C3OUT                         4783
#define CMP2OUT                       4784
#define CVRCON                        4785
#define CVR                           4786
#define CVR0                          4787
#define CVR1                          4788
#define CVR2                          4789
#define CVR3                          4790
#define CVR4                          4791
#define CVRR                          4792
#define CVRSS                         4793
#define CVROEN                        4794
#define CVROE                         4795
#define CVREN                         4796
#define PIE4                          4797
#define CCP3IE                        4798
#define CCP4IE                        4799
#define CCP5IE                        4800
#define CMP1IE                        4801
#define CMP2IE                        4802
#define EEIE                          4803
#define TMR4IE                        4804
#define PIR4                          4805
#define CCP3IF                        4806
#define CCP4IF                        4807
#define CCP5IF                        4808
#define CMP1IF                        4809
#define CMP2IF                        4810
#define EEIF                          4811
#define TMR4IF                        4812
#define IPR4                          4813
#define CCIP3IP                       4814
#define CCP3IP                        4815
#define CCP4IP                        4816
#define CCP5IP                        4817
#define CMP1IP                        4818
#define CMP2IP                        4819
#define EEIP                          4820
#define TMR4IP                        4821
#define BAUDCON2                      4822
#define ABDEN2                        4823
#define BAUDCON2_ABDEN                4824
#define WUE2                          4825
#define BAUDCON2_WUE                  4826
#define BRG162                        4827
#define BAUDCON2_BRG16                4828
#define SCKP2                         4829
#define TXCKP2                        4830
#define BAUDCON2_TXCKP                4831
#define DTRXP2                        4832
#define RXDTP2                        4833
#define BAUDCON2_RXDTP                4834
#define RCMT2                         4835
#define RCIDL2                        4836
#define BAUDCON2_RCIDL                4837
#define BAUDCON2_RCMT                 4838
#define BAUDCON2_ABDOVF               4839
#define ABDOVF2                       4840
#define TXSTA2                        4841
#define TX9D2                         4842
#define TXSTA2_TX9D                   4843
#define TXD82                         4844
#define TRMT2                         4845
#define TXSTA2_TRMT                   4846
#define BRGH2                         4847
#define TXSTA2_BRGH                   4848
#define SENDB2                        4849
#define TXSTA2_SENDB                  4850
#define TXSTA2_SYNC                   4851
#define SYNC2                         4852
#define TXEN2                         4853
#define TXSTA2_TXEN                   4854
#define TX8_92                        4855
#define TX92                          4856
#define TXSTA2_TX9                    4857
#define TXSTA2_CSRC                   4858
#define CSRC2                         4859
#define CCP1CON                       4860
#define CCP1M0                        4861
#define CCP1M                         4862
#define CCP1M1                        4863
#define CCP1M2                        4864
#define CCP1M3                        4865
#define CCP1Y                         4866
#define DC1B                          4867
#define DC1B0                         4868
#define CCP1X                         4869
#define DC1B1                         4870
#define P1M                           4871
#define P1M0                          4872
#define P1M1                          4873
#define CCPR1L                        4874
#define CCPR1H                        4875
#define ECCP1DEL                      4876
#define P1DC                          4877
#define P1DC0                         4878
#define P1DC1                         4879
#define P1DC2                         4880
#define P1DC3                         4881
#define P1DC4                         4882
#define P1DC5                         4883
#define P1DC6                         4884
#define P1RSEN                        4885
#define PSS1BD0                       4886
#define PSS1BD                        4887
#define PSS1BD1                       4888
#define PSS1AC                        4889
#define PSS1AC0                       4890
#define PSS1AC1                       4891
#define ECCP1AS                       4892
#define ECCP1AS0                      4893
#define ECCP1AS1                      4894
#define ECCP1AS2                      4895
#define ECCP1ASE                      4896
#define ADCON2                        4897
#define ADCS0                         4898
#define ADCS                          4899
#define ADCS1                         4900
#define ADCS2                         4901
#define ACQT0                         4902
#define ACQT                          4903
#define ACQT1                         4904
#define ACQT2                         4905
#define ADFM                          4906
#define ADCON1                        4907
#define CHSN0                         4908
#define CHSN                          4909
#define CHSN1                         4910
#define CHSN2                         4911
#define VNCFG                         4912
#define CHSN3                         4913
#define VCFG                          4914
#define VCFG01                        4915
#define VCFG0                         4916
#define VCFG11                        4917
#define VCFG1                         4918
#define TRIGSEL                       4919
#define TRIGSEL0                      4920
#define TRIGSEL1                      4921
#define ADCON0                        4922
#define ADON                          4923
#define nDONE                         4924
#define GO_nDONE                      4925
#define NOT_DONE                      4926
#define GODONE                        4927
#define GO_DONE                       4928
#define DONE                          4929
#define GO_NOT_DONE                   4930
#define GO                            4931
#define CHS0                          4932
#define CHS                           4933
#define CHS1                          4934
#define CHS2                          4935
#define CHS3                          4936
#define CHS4                          4937
#define ADRESL                        4938
#define ADRESH                        4939
#define SSPCON2                       4940
#define SEN                           4941
#define RSEN                          4942
#define ADMSK1                        4943
#define PEN                           4944
#define ADMSK2                        4945
#define RCEN                          4946
#define ADMSK3                        4947
#define ACKEN                         4948
#define ADMSK4                        4949
#define ADMSK5                        4950
#define ACKDT                         4951
#define ACKSTAT                       4952
#define GCEN                          4953
#define SSPCON1                       4954
#define SSPM0                         4955
#define SSPM                          4956
#define SSPM1                         4957
#define SSPM2                         4958
#define SSPM3                         4959
#define CKP                           4960
#define SSPEN                         4961
#define SSPOV                         4962
#define WCOL                          4963
#define SSPSTAT                       4964
#define BF                            4965
#define UA                            4966
#define R_NOT_W                       4967
#define READ_WRITE                    4968
#define NOT_W                         4969
#define R_W                           4970
#define nW                            4971
#define RW                            4972
#define nWRITE                        4973
#define NOT_WRITE                     4974
#define R_nW                          4975
#define I2C_READ                      4976
#define START                         4977
#define S                             4978
#define I2C_START                     4979
#define STOP                          4980
#define I2C_STOP                      4981
#define P                             4982
#define NOT_A                         4983
#define DATA_ADDRESS                  4984
#define nA                            4985
#define D_A                           4986
#define D_nA                          4987
#define DA                            4988
#define D_NOT_A                       4989
#define NOT_ADDRESS                   4990
#define nADDRESS                      4991
#define I2C_DAT                       4992
#define CKE                           4993
#define SMP                           4994
#define SSPADD                        4995
#define MSK0                          4996
