tiborsimon/embedded-tdd-headers/pic/pic18/pic18lf65k80_tdd.h
#define MSK1                          4997
#define MSK2                          4998
#define MSK3                          4999
#define MSK4                          5000
#define MSK5                          5001
#define MSK6                          5002
#define MSK7                          5003
#define SSPBUF                        5004
#define T2CON                         5005
#define T2CKPS0                       5006
#define T2CKPS                        5007
#define T2CKPS1                       5008
#define TMR2ON                        5009
#define T2OUTPS0                      5010
#define T2OUTPS                       5011
#define T2OUTPS1                      5012
#define T2OUTPS2                      5013
#define T2OUTPS3                      5014
#define WM0                           5015
#define PR2                           5016
#define WM1                           5017
#define WAIT0                         5018
#define WAIT1                         5019
#define EBDIS                         5020
#define TMR2                          5021
#define T1CON                         5022
#define TMR1ON                        5023
#define T1CON_RD16                    5024
#define NOT_T1SYNC                    5025
#define nT1SYNC                       5026
#define T1OSCEN                       5027
#define T1CON_SOSCEN                  5028
#define T1CKPS0                       5029
#define T1CKPS                        5030
#define T1CKPS1                       5031
#define TMR1CS0                       5032
#define TMR1CS                        5033
#define T1RD16                        5034
#define TMR1CS1                       5035
#define TMR1L                         5036
#define TMR1H                         5037
#define RCON                          5038
#define BOR                           5039
#define NOT_BOR                       5040
#define nBOR                          5041
#define POR                           5042
#define nPOR                          5043
#define NOT_POR                       5044
#define PD                            5045
#define nPD                           5046
#define NOT_PD                        5047
#define nTO                           5048
#define TO                            5049
#define NOT_TO                        5050
#define nRI                           5051
#define NOT_RI                        5052
#define RI                            5053
#define NOT_CM                        5054
#define CM                            5055
#define nCM                           5056
#define SBOREN                        5057
#define IPEN                          5058
#define WDTCON                        5059
#define SWDTEN                        5060
#define SWDTE                         5061
#define ULPSINK                       5062
#define ULPEN                         5063
#define SRETEN                        5064
#define ULPLVL                        5065
#define REGSLP                        5066
#define OSCCON2                       5067
#define LVDL0                         5068
#define MFIOSEL                       5069
#define MFIOFS                        5070
#define LVDL1                         5071
#define LVDL2                         5072
#define SOSCGO                        5073
#define LVDL3                         5074
#define SOSCDRV                       5075
#define SOSCRUN                       5076
#define OSCCON                        5077
#define SCS0                          5078
#define SCS                           5079
#define SCS1                          5080
#define HFIOFS                        5081
#define OSTS                          5082
#define IRCF                          5083
#define IRCF0                         5084
#define IRCF1                         5085
#define IRCF2                         5086
#define IDLEN                         5087
#define T0CON                         5088
#define T0PS                          5089
#define T0PS0                         5090
#define T0PS1                         5091
#define T0PS2                         5092
#define PSA                           5093
#define T0SE                          5094
#define T0CS                          5095
#define T08BIT                        5096
#define TMR0ON                        5097
#define TMR0L                         5098
#define TMR0H                         5099
#define STATUS                        5100
#define C                             5101
#define CARRY                         5102
#define DC                            5103
#define ZERO                          5104
#define Z                             5105
#define OV                            5106
#define OVERFLOW                      5107
#define N                             5108
#define NEGATIVE                      5109
#define FSR2L                         5110
#define FSR2H                         5111
#define PLUSW2                        5112
#define PREINC2                       5113
#define POSTDEC2                      5114
#define POSTINC2                      5115
#define INDF2                         5116
#define BSR                           5117
#define FSR1L                         5118
#define FSR1H                         5119
#define PLUSW1                        5120
#define PREINC1                       5121
#define POSTDEC1                      5122
#define POSTINC1                      5123
#define INDF1                         5124
#define WREG                          5125
#define FSR0L                         5126
#define FSR0H                         5127
#define PLUSW0                        5128
#define PREINC0                       5129
#define POSTDEC0                      5130
#define POSTINC0                      5131
#define INDF0                         5132
#define INTCON3                       5133
#define INT1IF                        5134
#define INT1F                         5135
#define INT2IF                        5136
#define INT2F                         5137
#define INT3F                         5138
#define INT3IF                        5139
#define INT1E                         5140
#define INT1IE                        5141
#define INT2IE                        5142
#define INT2E                         5143
#define INT3E                         5144
#define INT3IE                        5145
#define INT1P                         5146
#define INT1IP                        5147
#define INT2IP                        5148
#define INT2P                         5149
#define INTCON2                       5150
#define RBIP                          5151
#define INT3IP                        5152
#define INT3P                         5153
#define TMR0IP                        5154
#define T0IP                          5155
#define INTEDG3                       5156
#define INTEDG2                       5157
#define INTEDG1                       5158
#define INTEDG0                       5159
#define RBPU                          5160
#define NOT_RBPU                      5161
#define nRBPU                         5162
#define INTCON                        5163
#define RBIF                          5164
#define INT0F                         5165
#define INT0IF                        5166
#define T0IF                          5167
#define TMR0IF                        5168
#define RBIE                          5169
#define INT0E                         5170
#define INT0IE                        5171
#define T0IE                          5172
#define TMR0IE                        5173
#define PEIE                          5174
#define PEIE_GIEL                     5175
#define GIEL                          5176
#define GIE_GIEH                      5177
#define GIE                           5178
#define GIEH                          5179
#define PRODL                         5180
#define PRODH                         5181
#define TABLAT                        5182
#define TBLPTRL                       5183
#define TBLPTRH                       5184
#define TBLPTRU                       5185
#define PCL                           5186
#define PCLATH                        5187
#define PCH                           5188
#define PCLATU                        5189
#define PCU                           5190
#define SP0                           5191
#define STKPTR                        5192
#define SP1                           5193
#define SP2                           5194
#define SP3                           5195
#define SP4                           5196
#define STKUNF                        5197
#define STKOVF                        5198
#define STKFUL                        5199
#define TOSL                          5200
#define TOSH                          5201
#define TOSU                          5202

#endif // _PIC18LF65K80_H_
